src/main/java/com/amdocs/halo/automation/xmls/manageOrderRequestAVPNSL_NS_SG.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <manageOrderRequest xmlns="http://cio.att.com/order/management/model" xmlns:ns0="http://cio.att.com/ord/model" xmlns:ns2="http://cio.att.com/req/model" xmlns:ns1="http://cio.att.com/entity/model">
         <order>
            <ns2:eid>
               <ns1:context>OCX</ns1:context>
               <ns1:id>{$sorId$}</ns1:id>
               <ns1:entityType>SOR</ns1:entityType>
            </ns2:eid>
            <ns0:isBundle>true</ns0:isBundle>
            <ns0:subOrders>
               <ns0:item>
                  <ns2:eid>
                     <ns1:context>OCX</ns1:context>
                     <ns1:id>{$sgId$}</ns1:id>
                     <ns1:entityType>Order</ns1:entityType>
                  </ns2:eid>
                  <ns2:type>DECOMPOSE</ns2:type>
                  <ns2:characteristics>
                     <ns1:item>
                        <ns1:name>ServiceGroupOrderId</ns1:name>
                        <ns1:value>{$sgId$}</ns1:value>
                     </ns1:item>
                     <ns1:item>
                        <ns1:name>serviceGroupCounter</ns1:name>
                        <ns1:value>1</ns1:value>
                     </ns1:item>
                  </ns2:characteristics>
                  <ns2:associations>
                     <ns1:item>
                        <ns1:associationName>associatedServiceOrder</ns1:associationName>
                        <ns1:items>
                           <ns1:item>
                              <ns1:context>OCX</ns1:context>
                              <ns1:id>{$oaId$}</ns1:id>
                              <ns1:entityType>OrderAction</ns1:entityType>
                              <ns1:type>AVPNSL</ns1:type>
                              <ns1:product>AVPN Siteless</ns1:product>
                           </ns1:item>
                        </ns1:items>
                     </ns1:item>
                  </ns2:associations>
                  <ns0:isBundle>false</ns0:isBundle>
                  <ns0:actionType>PR</ns0:actionType>
                  <ns0:actionSubType>NA</ns0:actionSubType>
                  <ns0:version>1</ns0:version>
               </ns0:item>
            </ns0:subOrders>
         </order>
      </manageOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>